BaseUz = [
    {
        # 1
        'number': 1,
        'question': "Ҳозирги яшаш ҳудудингизни кўрсатинг",
        'answers': (
            "Қорақалпоғистон Республикаси",
            "Андижон вилояти",
            "Бухоро вилояти",
            "Жиззах вилояти",
            "Қашқадарё вилояти",
            "Навоий вилояти",
            "Наманган вилояти",
            "Самарқанд вилояти",
            "Сурхандарё вилояти",
            "Сирдарё вилояти",
            "Тошкент вилояти",
            "Фарғона вилояти",
            "Хоразм вилояти",
            "Тошкент шаҳри"
        ),
        'more_answers': False
    },
    {
        # 2
        'number': 2,
        'question': "Оила аъзоларингиз неча кишидан иборат?",
        'answers': (
            "1", "2", "3", "4", "5", "6", "7", "8 ва ундан ортиқ",
        ),
        'more_answers': False
    },
    {
        # 3
        'number': 3,
        'question': "Оила аъзоларингизнинг асосий меҳнат фаолият турларини белгиланг\n"
                    "Бир нечта вариантни танлашингиз мумкин",
        'answers': (
            "қишлоқ, ўрмон ва балиқ хўжалиги",
            "саноат",
            "қурилиш",
            "савдо",
            "ҳайдовчилик, юк ташиш ва етказиб бериш хизматлари",
            "ахборот ва алоқа",
            "молия соҳаси (банк, суғурта ва бошқалар)",
            "таълим",
            "соғлиқни сақлаш ва ижтимоий хизматлар",
            "умумий овқатланиш хизмати",
            "яшаш хизмати (меҳмонхона)",
            "санъат, кўнгил очиш ва дам олиш",
            "якка тартибдаги тадбиркорлик",
            "бошқалар",
        ),
        'more_answers': True
    },
    {
        # 4
        'number': 4,
        'question': "Асосий меҳнат фаолияти бўйича оилангизнинг ўртача ойлик даромади қанча?",
        'answers': (
            "2 млн сўмдан кам",
            "2 млн сўмдан 4 млн сўмгача",
            "4 млн сўмдан 6 млн сўмгача",
            "6 млн сўмдан 8 млн сўмгача",
            "8 млн сўмдан 10 млн сўмгача",
            "10 млн сўмдан 12 млн сўмгача",
            "12 млн сўмдан 14 млн сўмгача",
            "14 млн сўмдан 16 млн сўмгача",
            "16 млн сўмдан 18 млн сўмгача",
            "18 млн сўмдан 20 млн сўмгача",
            "20 млн сўмдан 22 млн сўмгача",
            "22 млн сўмдан 24 млн сўмгача",
            "24 млн сўмдан 26 млн сўмгача",
            "26 млн сўмдан 28 млн сўмгача",
            "28 млн сўмдан 30 млн сўмгача",
            "30 млн сўм ва ундан юқори",
        ),
        'more_answers': False
    },
    {
        # 5
        'number': 5,
        'question': "Оила аъзоларингиз қўшимча доимий даромад манбаига эгами (масалан, уй-жой, ер ва транспорт "
                    "воситаларини ижарага бериш, банкка қўйилган омонатлар бўйича фоиз даромадлари ва бошқалар)?",
        'answers': (
            "ҳа",
            "йўқ",
        ),
        'more_answers': False
    },
    {
        # 6
        'number': 6,
        'question': "Оилангизнинг қўшимча ўртача ойлик даромади қанча?",
        'answers': (
            "2 млн сўмдан кам",
            "2 млн сўмдан 4 млн сўмгача",
            "4 млн сўмдан 6 млн сўмгача",
            "6 млн сўмдан 8 млн сўмгача",
            "8 млн сўмдан 10 млн сўмгача",
            "10 млн сўм ва ундан юқори",
        ),
        'more_answers': False
    },
    {
        # 7
        'number': 7,
        'question': "Айни вақтда сиз ёки оила аъзоларингизда кредит ёки қарз мажбуриятлари мавжудми?",
        'answers': (
            "ҳа",
            "йўқ"
        ),
        'more_answers': False
    },
    {
        # 8
        'number': 8,
        'question': "Бу қандай кредит ёки қарз мажбуриятлари?\n"
                    "Бир нечта вариантни танлашингиз мумкин.",
        'answers': (
            "банк кредити",

            "нобанк кредит ташкилотлари (ломбардлар, микромолия ташкилотлари, лизинг корхоналари ва бошқалар) "
            "олдидаги қарз",

            "номолиявий ташкилотлар олдидаги қарз (масалан, уй-жой, автомобил, маиший техника, электроника ва "
            "бошқаларни тўғридан-тўғри уй-жой қурувчи компаниялар, автодиллерлар, дўконлар орқали муддатли тўлов "
            "асосида харид қилиш)",

            "бошқа қарзлар",
        ),
        'more_answers': True
    },
    {
        # 9
        'number': 9,
        'question': "Ушбу кредит ёки қарзларни қайси мақсадларда олгансиз?\n"
                    "Бир нечта вариантни танлашингиз мумкин",
        'answers': (
            "кўчмас мулкни сотиб олиш ёки таъмирлаш",
            "автомобилни сотиб олиш",
            "истеъмол товарларини (маиший техника, мебел ва бошқалар) сотиб олиш",
            "хусусий тадбиркорликни ривожлантириш",
            "даволаниш",
            "таълим",
            "тўй маросимини ўтказиш",
            "дам олиш",
            "кундалик харажатлар",
            "бошқа кредит ёки қарзни тўлаш",
            "бошқалар"
        ),
        'more_answers': True
    },
    {
        # 10
        'number': 10,
        'question': "Ушбу кредит ёки қарз мажбуриятлари бўйича жами ойлик тўлов миқдори қанча?",
        'answers': (
            "2 млн сўмдан кам",
            "2 млн сўмдан 4 млн сўмгача",
            "4 млн сўмдан 6 млн сўмгача",
            "6 млн сўмдан 8 млн сўмгача",
            "8 млн сўмдан 10 млн сўмгача",
            "10 млн сўмдан 12 млн сўмгача",
            "12 млн сўмдан 14 млн сўмгача",
            "14 млн сўмдан 16 млн сўмгача",
            "16 млн сўмдан 18 млн сўмгача",
            "18 млн сўмдан 20 млн сўмгача",
            "20 млн сўм ва ундан юқори"
        ),
        'more_answers': False
    },
    {
        # 11
        'number': 11,
        'question': "Ушбу кредит ёки қарз мажбуриятларининг сўндириш муддати қанча?",
        'answers': (
            "1 йилдан кам",
            "1 йилдан 2 йилгача",
            "2 йилдан 3 йилгача",
            "3 йилдан 4 йилгача",
            "4 йилдан 5 йилгача",
            "5 йил ва ундан юқори",
        ),
        'more_answers': False
    },
    {
        # 12
        'number': 12,
        'question': "Кредит ёки қарз мажбуриятларини ўз вақтида қайтаришда (ойлик тўлов) "
                    "қийинчиликларга дуч келябсизми?",
        'answers': (
            "ҳа",
            "йўқ"
        ),
        'more_answers': False
    },
    {
        # 13
        'number': 13,
        'question': "Сизнинг фикрингизча, кейинги 6 ойда оилангизнинг тўлов қобилияти қандай ўзгаради?",
        'answers': (
            "яхшиланади",
            "ўзгармайди",
            "ёмонлашади"
        ),
        'more_answers': False
    },
    {
        # 14
        'number': 14,
        'question': "Кейинги 6 ойда сиз ёки оилангиз аъзолари кредит ёки қарз олмоқчимисиз?",
        'answers': (
            "ҳа",
            "йўқ",
            "жавоб беришим қийин"
        ),
        'more_answers': False
    },
    {
        # 15
        'number': 15,
        'question': "Ушбу кредит ёки қарзларни қайси мақсадларда олмоқчисиз?\n"
                    "Бир нечта вариантни танлашингиз мумкин",
        'answers': (
            "кўчмас мулкни сотиб олиш ёки таъмирлаш",
            "автомобилни сотиб олиш",
            "истеъмол товарларини (маиший техника, мебел ва бошқалар) сотиб олиш",
            "хусусий тадбиркорликни ривожлантириш",
            "даволаниш",
            "таълим",
            "тўй маросимини ўтказиш",
            "дам олиш",
            "кундалик харажатлар",
            "бошқа кредит ёки қарзни тўлаш",
            "бошқалар"
        ),
        'more_answers': True
    }
]


async def is_more_answers(question_id: int) -> bool:
    global BaseUz
    return BaseUz[question_id].get('more_answers')


async def get_question_text_uz(question_id: int) -> str:
    global BaseUz
    return BaseUz[question_id - 1].get('question')


async def get_question_answers_uz(question_id: int) -> list:
    global BaseUz
    return list(BaseUz[question_id - 1].get('answers'))
